Revit 2026 API

# AreaBasedLoadDataPhasesNumber Property

---

The number of electrical phases of the area based load.

**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public int PhasesNumber { get; set; }
```
```vb
Public Property PhasesNumber As Integer
	Get
	Set
```
```cpp
public:
property int PhasesNumber {
	int get ();
	void set (int value);
}
```
```fsharp
member PhasesNumber : int with get, set
```

#### Property Value

Int32

| Exception | Condition |
| --- | --- |
| ArgumentException | When setting this property: The number of electrical phases numberOfPhases is not valid, only 1, 3 is valid. |

This property is used to retrieve the number of electrical phases.

#### Reference

AreaBasedLoadData Class

Autodesk.Revit.DB.Electrical Namespace